Repository: RonanDavalan/vosk-cli-dictation
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fr

source: A Vosk-based command-line dictation tool.
fr: Outil de dictée en ligne de commande basé sur Vosk.

source: Force the interface and model language.
fr: Forcer la langue de l'interface et du modèle.

source: - Say '{start_word}' or press {hotkey} to start/stop.
fr: - Dites '{start_word}' ou appuyez sur {hotkey} pour démarrer/arrêter.

source: - Say '{stop_word}' or press {hotkey} to stop and copy.
fr: - Dites '{stop_word}' ou appuyez sur {hotkey} pour arrêter et copier.

source: {style} Manual commands:{reset}
fr: {style} Commandes manuelles :{reset}

source: - '/change_language <lang_name>' (e.g., /change_language en)
fr: - '/change_language <lang_name>' (ex: /change_language en)

source: {style} Punctuation commands:{reset}
fr: {style} Commandes de ponctuation :{reset}

source: Press Ctrl+C to exit the program.
fr: Appuyez sur Ctrl+C pour quitter le programme.

source: Program stopped cleanly.
fr: Programme arrêté proprement.

source: Checking external dependencies...
fr: Vérification des dépendances externes...

source: 'xdotool' is a critical dependency and is not installed.
fr: 'xdotool' est une dépendance critique et n'est pas installé.

source: Please install it (e.g., 'sudo apt-get install xdotool').
fr: Veuillez l'installer (ex: 'sudo apt-get install xdotool').

source: 'paplay' not found. Sound notifications will be disabled.
fr: 'paplay' non trouvé. Les notifications sonores seront désactivées.

source: Dependencies checked.
fr: Dépendances vérifiées.

source: Attempting to load model for language: {lang}
fr: Tentative de chargement du modèle pour la langue : {lang}

source: Failed. Attempting to load default model: {model_name}
fr: Échec. Tentative de chargement du modèle par défaut : {model_name}

source: FATAL: No speech recognition model could be loaded.
fr: FATAL : Aucun modèle de reconnaissance vocale n'a pu être chargé.

source: Please check the model paths and integrity in your config.yaml file.
fr: Veuillez vérifier les chemins et l'intégrité des modèles dans votre fichier config.yaml.

source: The script is ready. Current model: {model_name}
fr: Le script est prêt. Modèle actuel : {model_name}

source: Stop request received. Shutting down...
fr: Demande d'arrêt reçue. Arrêt en cours...

source: Error: Model folder not found:
fr: Erreur : Dossier du modèle introuvable :

source: Please check your config.yaml and ensure the model is unzipped.
fr: Veuillez vérifier votre config.yaml et vous assurer que le modèle est décompressé.

source: Attempting to load model:
fr: Tentative de chargement du modèle :

source: Model loaded successfully:
fr: Modèle chargé avec succès :

source: Fatal error while loading model '{model_name}': {error}
fr: Erreur fatale lors du chargement du modèle '{model_name}' : {error}

source: [In progress]
fr: [En cours]

source: Error in recognition thread:
fr: Erreur dans le thread de reconnaissance :

source: Recording started.
fr: Enregistrement démarré.

source: Recording paused.
fr: Enregistrement en pause.

source: Recording finished. Text copied.
fr: Enregistrement terminé. Texte copié.

source: Session canceled.
fr: Session annulée.

source: Last word deleted (simulation).
fr: Dernier mot supprimé (simulation).

source: No text to modify.
fr: Aucun texte à modifier.

source: New paragraph inserted.
fr: Nouveau paragraphe inséré.

source: New paragraph added to buffer.
fr: Nouveau paragraphe ajouté au tampon.

source: UI language changed to:
fr: Langue de l'interface changée vers :

source: To change the recognition language, please restart the program with -l {lang}
fr: Pour changer la langue de reconnaissance, veuillez redémarrer le programme avec -l {lang}

source: Language not available. Available languages:
fr: Langue non disponible. Langues disponibles :

source: Usage: /change_language <lang_code>
fr: Usage : /change_language <code_langue>

source: Unknown command:
fr: Commande inconnue :

source: Warning: xdotool failed. Switching to log-only mode.
fr: Attention : xdotool a échoué. Passage en mode journal uniquement.

source: Typed:
fr: Tapé :

source: [Degraded Mode] Added:
fr: [Mode Dégradé] Ajouté :

source: Stopping user interface...
fr: Arrêt de l'interface utilisateur...
